In [81]:
import numpy as np
import pandas as pd

#显示所有列
pd.set_option('display.max_columns', None)
#显示所有行
pd.set_option('display.max_rows', None)
#设置value的显示长度为100，默认为50
pd.set_option('max_colwidth',100)

In [82]:
df = pd.DataFrame(
    {
        "id":[1001,1002,1003,1004,1005,1006], 
        "date":pd.date_range('20130102', periods=6),
        "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
        "age":[23,44,54,32,34,45],
        "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
        "price":[1200.9,np.nan,2133,5433.2,np.nan,4432]
    },
    columns =['id','date','city','category','age','price'])

df1 = pd.DataFrame({
        "id":[1001,1002,1003,1004,1005,1006,1007,108], 
        "gender":['male','female','male','female','male','female','male','female'],
        "pay":['Y','N','Y','Y','N','Y','N','Y',],
        "m-point":[10,12,20,40,40,40,30,20]})

# 一、信息表信息查看

## 1、查看前2行

df.head(2)

## 2、查看后2行

In [84]:
df.tail(2)

     id       date      city category  age   price
4  1005 2013-01-06  shanghai    210-A   34     NaN
5  1006 2013-01-07  BEIJING     130-F   45  4432.0

## 3、维度查看

In [85]:
df.shape

(6, 6)

## 4、数据表基本信息（维度、列名称、数据格式、所占空间等）

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes

## 5、每一列数据的格式

In [87]:
df.dtypes

id                   int64
date        datetime64[ns]
city                object
category            object
age                  int64
price              float64
dtype: object

## 6、category列格式

In [88]:
df['category'].dtype

dtype('O')

## 7、空值

In [89]:
df.isnull()

      id   date   city category    age  price
0  False  False  False    False  False  False
1  False  False  False    False  False   True
2  False  False  False    False  False  False
3  False  False  False    False  False  False
4  False  False  False    False  False   True
5  False  False  False    False  False  False

## 8、查看price列空值

In [90]:
df['price'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: price, dtype: bool

## 9、查看age列的唯一值

In [91]:
df['age'].unique()

array([23, 44, 54, 32, 34, 45], dtype=int64)

## 10、查看数据表的值

In [92]:
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.9],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou ', '110-A',
        54, 2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.2],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 45,
        4432.0]], dtype=object)

## 11、查看列名称

In [93]:
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

# 二、数据表清晰

## 1、使用price的均值对NA进行填充

In [94]:
df.fillna(value=100)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.9
1  1002 2013-01-03           SH    100-B   44   100.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.2
4  1005 2013-01-06     shanghai    210-A   34   100.0
5  1006 2013-01-07     BEIJING     130-F   45  4432.0

In [95]:
df['price'].fillna(df['price'].mean())

0    1200.900
1    3299.775
2    2133.000
3    5433.200
4    3299.775
5    4432.000
Name: price, dtype: float64

## 2、清除city字段的字符前后空格,字符的大小写转换

In [96]:
df['city']=df['city'].map(str.strip).map(str.upper)
df

     id       date       city category  age   price
0  1001 2013-01-02    BEIJING    100-A   23  1200.9
1  1002 2013-01-03         SH    100-B   44     NaN
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0
3  1004 2013-01-05   SHENZHEN    110-C   32  5433.2
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN
5  1006 2013-01-07    BEIJING    130-F   45  4432.0

## 3、更改数据格式

In [97]:
df['price'].fillna(value=100).astype('int')

0    1200
1     100
2    2133
3    5433
4     100
5    4432
Name: price, dtype: int32

## 4、更改列名称

In [98]:
df.rename(columns={'category': 'category-size'})

     id       date       city category-size  age   price
0  1001 2013-01-02    BEIJING         100-A   23  1200.9
1  1002 2013-01-03         SH         100-B   44     NaN
2  1003 2013-01-04  GUANGZHOU         110-A   54  2133.0
3  1004 2013-01-05   SHENZHEN         110-C   32  5433.2
4  1005 2013-01-06   SHANGHAI         210-A   34     NaN
5  1006 2013-01-07    BEIJING         130-F   45  4432.0

## 5、删除后出现的重复值

In [99]:
df['city'].drop_duplicates()

0      BEIJING
1           SH
2    GUANGZHOU
3     SHENZHEN
4     SHANGHAI
Name: city, dtype: object

## 6、数据替换

In [100]:
df['city'] = df['city'].replace('SH', 'shanghai')
df

     id       date       city category  age   price
0  1001 2013-01-02    BEIJING    100-A   23  1200.9
1  1002 2013-01-03   shanghai    100-B   44     NaN
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0
3  1004 2013-01-05   SHENZHEN    110-C   32  5433.2
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN
5  1006 2013-01-07    BEIJING    130-F   45  4432.0

# 三、数据预处理

## 1、内连接

In [101]:
df_inner=pd.merge(df,df1,how='inner')
df_inner

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    BEIJING    100-A   23  1200.9    male       10   Y
1  1002 2013-01-03   shanghai    100-B   44     NaN  female       12   N
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   SHENZHEN    110-C   32  5433.2  female       40   Y
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN    male       40   N
5  1006 2013-01-07    BEIJING    130-F   45  4432.0  female       40   Y

## 2、左连接

In [102]:
df_left = pd.merge(df, df1, how='left')
df_left

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    BEIJING    100-A   23  1200.9    male       10   Y
1  1002 2013-01-03   shanghai    100-B   44     NaN  female       12   N
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   SHENZHEN    110-C   32  5433.2  female       40   Y
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN    male       40   N
5  1006 2013-01-07    BEIJING    130-F   45  4432.0  female       40   Y

## 3、右连接

In [103]:
df_right = pd.merge(df, df1, how='right')
df_right

       id       date       city category   age   price  gender  m-point pay
0  1001.0 2013-01-02    BEIJING    100-A  23.0  1200.9    male       10   Y
1  1002.0 2013-01-03   shanghai    100-B  44.0     NaN  female       12   N
2  1003.0 2013-01-04  GUANGZHOU    110-A  54.0  2133.0    male       20   Y
3  1004.0 2013-01-05   SHENZHEN    110-C  32.0  5433.2  female       40   Y
4  1005.0 2013-01-06   SHANGHAI    210-A  34.0     NaN    male       40   N
5  1006.0 2013-01-07    BEIJING    130-F  45.0  4432.0  female       40   Y
6  1007.0        NaT        NaN      NaN   NaN     NaN    male       30   N
7   108.0        NaT        NaN      NaN   NaN     NaN  female       20   Y

## 4、外连接

In [104]:
df_outer = pd.merge(df, df1, how='outer')
df_outer

       id       date       city category   age   price  gender  m-point pay
0  1001.0 2013-01-02    BEIJING    100-A  23.0  1200.9    male       10   Y
1  1002.0 2013-01-03   shanghai    100-B  44.0     NaN  female       12   N
2  1003.0 2013-01-04  GUANGZHOU    110-A  54.0  2133.0    male       20   Y
3  1004.0 2013-01-05   SHENZHEN    110-C  32.0  5433.2  female       40   Y
4  1005.0 2013-01-06   SHANGHAI    210-A  34.0     NaN    male       40   N
5  1006.0 2013-01-07    BEIJING    130-F  45.0  4432.0  female       40   Y
6  1007.0        NaT        NaN      NaN   NaN     NaN    male       30   N
7   108.0        NaT        NaN      NaN   NaN     NaN  female       20   Y

## 5、设置索引列

In [105]:
df_outer.set_index('id')
df_outer = df_outer.sort_values('age')
df_outer

       id       date       city category   age   price  gender  m-point pay
0  1001.0 2013-01-02    BEIJING    100-A  23.0  1200.9    male       10   Y
3  1004.0 2013-01-05   SHENZHEN    110-C  32.0  5433.2  female       40   Y
4  1005.0 2013-01-06   SHANGHAI    210-A  34.0     NaN    male       40   N
1  1002.0 2013-01-03   shanghai    100-B  44.0     NaN  female       12   N
5  1006.0 2013-01-07    BEIJING    130-F  45.0  4432.0  female       40   Y
2  1003.0 2013-01-04  GUANGZHOU    110-A  54.0  2133.0    male       20   Y
6  1007.0        NaT        NaN      NaN   NaN     NaN    male       30   N
7   108.0        NaT        NaN      NaN   NaN     NaN  female       20   Y

## 6、按字段信息增加辅助列（如果price列的值>3000，group列显示high，否则显示low）

In [106]:
df_outer['group'] = np.where(df_outer['price'] > 3000,'high','low')
df_outer

,id,date,city,category,age,price,gender,m-point,pay,group
0,1001.0,2013-01-02,BEIJING,100-A,23.0,1200.9,male,10,Y,low
3,1004.0,2013-01-05,SHENZHEN,110-C,32.0,5433.2,female,40,Y,high
4,1005.0,2013-01-06,SHANGHAI,210-A,34.0,NaN,male,40,N,low
1,1002.0,2013-01-03,shanghai,100-B,44.0,NaN,female,12,N,low
5,1006.0,2013-01-07,BEIJING,130-F,45.0,4432.0,female,40,Y,high
2,1003.0,2013-01-04,GUANGZHOU,110-A,54.0,2133.0,male,20,Y,low
6,1007.0,NaT,NaN,NaN,NaN,NaN,male,30,N,low
7,108.0,NaT,NaN,NaN,NaN,NaN,female,20,Y,low

## 7、对复合多个条件的数据进行分组标记

In [107]:
df_inner.loc[(df_inner['city'].map(str.lower) == 'beijing') & (df_inner['price'] >= 4000), 'sign'] = 1
df_inner

     id       date       city category  age   price  gender  m-point pay  sign
0  1001 2013-01-02    BEIJING    100-A   23  1200.9    male       10   Y   NaN
1  1002 2013-01-03   shanghai    100-B   44     NaN  female       12   N   NaN
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0    male       20   Y   NaN
3  1004 2013-01-05   SHENZHEN    110-C   32  5433.2  female       40   Y   NaN
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN    male       40   N   NaN
5  1006 2013-01-07    BEIJING    130-F   45  4432.0  female       40   Y   1.0

## 8、对category字段的值依次进行分列，并创建数据表，索引值为df_inner的索引列，列名称为category和size

In [108]:
split = pd.DataFrame(
        (x.split('-') for x in df_inner['category']),
        index=df_inner.index,
        columns=['category','size'])
split

  category size
0      100    A
1      100    B
2      110    A
3      110    C
4      210    A
5      130    F

## 9、将完成分裂后的数据表和原df_inner数据表进行匹配

In [109]:
df_inner=pd.merge(df_inner,split,right_index=True, left_index=True)
df_inner

,id,date,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
0,1001,2013-01-02,BEIJING,100-A,23,1200.9,male,10,Y,NaN,100,A
1,1002,2013-01-03,shanghai,100-B,44,NaN,female,12,N,NaN,100,B
2,1003,2013-01-04,GUANGZHOU,110-A,54,2133.0,male,20,Y,NaN,110,A
3,1004,2013-01-05,SHENZHEN,110-C,32,5433.2,female,40,Y,NaN,110,C
4,1005,2013-01-06,SHANGHAI,210-A,34,NaN,male,40,N,NaN,210,A
5,1006,2013-01-07,BEIJING,130-F,45,4432.0,female,40,Y,1.0,130,F

# 四、数据提取

## 1、按索引提取单行的数值

In [110]:
df_inner.loc[0]

id                           1001
date          2013-01-02 00:00:00
city                      BEIJING
category_x                  100-A
age                            23
price                      1200.9
gender                       male
m-point                        10
pay                             Y
sign                          NaN
category_y                    100
size                            A
Name: 0, dtype: object

## 2、按索引提取区域行数值

In [111]:
df_inner.iloc[0:2]

,id,date,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
0,1001,2013-01-02,BEIJING,100-A,23,1200.9,male,10,Y,NaN,100,A
1,1002,2013-01-03,shanghai,100-B,44,NaN,female,12,N,NaN,100,B

## 3、重设索引

In [112]:
df_inner.reset_index()

,index,id,date,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
0,0,1001,2013-01-02,BEIJING,100-A,23,1200.9,male,10,Y,NaN,100,A
1,1,1002,2013-01-03,shanghai,100-B,44,NaN,female,12,N,NaN,100,B
2,2,1003,2013-01-04,GUANGZHOU,110-A,54,2133.0,male,20,Y,NaN,110,A
3,3,1004,2013-01-05,SHENZHEN,110-C,32,5433.2,female,40,Y,NaN,110,C
4,4,1005,2013-01-06,SHANGHAI,210-A,34,NaN,male,40,N,NaN,210,A
5,5,1006,2013-01-07,BEIJING,130-F,45,4432.0,female,40,Y,1.0,130,F

## 4、设置日期为索引

In [113]:
df_inner=df_inner.set_index('date') 
df_inner

,id,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
date,,,,,,,,,,,
2013-01-02,1001,BEIJING,100-A,23,1200.9,male,10,Y,NaN,100,A
2013-01-03,1002,shanghai,100-B,44,NaN,female,12,N,NaN,100,B
2013-01-04,1003,GUANGZHOU,110-A,54,2133.0,male,20,Y,NaN,110,A
2013-01-05,1004,SHENZHEN,110-C,32,5433.2,female,40,Y,NaN,110,C
2013-01-06,1005,SHANGHAI,210-A,34,NaN,male,40,N,NaN,210,A
2013-01-07,1006,BEIJING,130-F,45,4432.0,female,40,Y,1.0,130,F

## 5、提取1月4日之前所有的数据

In [114]:
df_inner[:'2013-01-04']

,id,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
date,,,,,,,,,,,
2013-01-02,1001,BEIJING,100-A,23,1200.9,male,10,Y,NaN,100,A
2013-01-03,1002,shanghai,100-B,44,NaN,female,12,N,NaN,100,B
2013-01-04,1003,GUANGZHOU,110-A,54,2133.0,male,20,Y,NaN,110,A

## 6、使用iloc按位置区域提取数据

### 6.1冒号前后的数字不再是索引的标签名称，而是数据所在的位置，从0开始，前三行，前两列。

In [115]:
df_inner.iloc[:2,:2]

              id      city
date
2013-01-02  1001   BEIJING
2013-01-03  1002  shanghai

### 6.2提取第0、2、5行，4、5列

In [156]:
df_inner.iloc[[0,2,5],[4,5]]

             price  gender
date
2013-01-02  1200.9    male
2013-01-04  2133.0    male
2013-01-07  4432.0  female

## 7、使用ix按索引标签和位置混合提取数据

### 2013-01-03号之前，前四列数据

In [118]:
df_inner.ix[:'2013-01-03',:4]

              id      city category_x  age
date
2013-01-02  1001   BEIJING      100-A   23
2013-01-03  1002  shanghai      100-B   44

## 8、判断city列的值是否为北京

In [119]:
df_inner['city'].isin(['BEIJING'])

date
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
2013-01-07     True
Name: city, dtype: bool

## 9、判断city列里是否包含beijing和shanghai，然后将符合条件的数据提取出来'

In [120]:
df_inner.loc[df_inner['city'].isin(['BEIJING','shanghai'])]

,id,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
date,,,,,,,,,,,
2013-01-02,1001,BEIJING,100-A,23,1200.9,male,10,Y,NaN,100,A
2013-01-03,1002,shanghai,100-B,44,NaN,female,12,N,NaN,100,B
2013-01-07,1006,BEIJING,130-F,45,4432.0,female,40,Y,1.0,130,F

## 9、提取前三个字符，并生成数据表

In [121]:
test = pd.DataFrame(df['category'].str[:3])
test

  category
0      100
1      100
2      110
3      110
4      210
5      130

# 五、数据筛选

## 1、找出年龄大于25并且在beijing的记录

In [122]:
df.loc[
        (df['age'] > 25) & (df['city'].str.lower() == 'beijing'), 
        ['id','city','age','category','price']]

     id     city  age category   price
5  1006  BEIJING   45    130-F  4432.0

## 2、找出年龄大于35或者在beijing的记录'

In [123]:
df.loc[
        (df['age'] > 35) | (df['city'].str.lower() == 'beijing'), 
        ['id','city','age','category','price']]

     id       city  age category   price
0  1001    BEIJING   23    100-A  1200.9
1  1002   shanghai   44    100-B     NaN
2  1003  GUANGZHOU   54    110-A  2133.0
5  1006    BEIJING   45    130-F  4432.0

## 3、找出不在beijing的记录,对筛选后的数据按city列进行计数

In [128]:
test = df.loc[
            (df['city'].str.lower() != 'beijing'), 
            ['id','city','age','category','price']]
test

     id       city  age category   price
1  1002   shanghai   44    100-B     NaN
2  1003  GUANGZHOU   54    110-A  2133.0
3  1004   SHENZHEN   32    110-C  5433.2
4  1005   SHANGHAI   34    210-A     NaN

In [130]:
'总数：'+str(test.sort_values(['age'],ascending = False).city.count())

'总数：4'

## 4、使用query函数进行筛选

In [131]:
df.query('city == ["BEIJING", "shanghai"]')

     id       date      city category  age   price
0  1001 2013-01-02   BEIJING    100-A   23  1200.9
1  1002 2013-01-03  shanghai    100-B   44     NaN
5  1006 2013-01-07   BEIJING    130-F   45  4432.0

## 5、对筛选后的结果按prince进行求和

In [132]:
df.query('city == ["BEIJING", "shanghai"]').price.sum()

5632.9

# 六、数据汇总

## 1、对所有的列进行计数汇总

In [133]:
df.groupby('city').count()

           id  date  category  age  price
city
BEIJING     2     2         2    2      2
GUANGZHOU   1     1         1    1      1
SHANGHAI    1     1         1    1      0
SHENZHEN    1     1         1    1      1
shanghai    1     1         1    1      0

## 2、按城市对id字段进行计数

In [134]:
df.groupby('city')['id'].count()

city
BEIJING      2
GUANGZHOU    1
SHANGHAI     1
SHENZHEN     1
shanghai     1
Name: id, dtype: int64

## 3、对两个字段进行汇总计数

In [135]:
df.groupby(['city','age'])['id'].count()

city       age
BEIJING    23     1
           45     1
GUANGZHOU  54     1
SHANGHAI   34     1
SHENZHEN   32     1
shanghai   44     1
Name: id, dtype: int64

## 4、对city字段进行汇总，并分别计算prince的合计和均值

In [136]:
df.groupby('city')['price'].agg([len,np.sum, np.mean])

           len     sum     mean
city
BEIJING    2.0  5632.9  2816.45
GUANGZHOU  1.0  2133.0  2133.00
SHANGHAI   1.0     NaN      NaN
SHENZHEN   1.0  5433.2  5433.20
shanghai   1.0     NaN      NaN

# 七、数据统计

## 1、简单的数据采样

In [137]:
df_inner.sample(n=3)

,id,city,category_x,age,price,gender,m-point,pay,sign,category_y,size
date,,,,,,,,,,,
2013-01-03,1002,shanghai,100-B,44,NaN,female,12,N,NaN,100,B
2013-01-05,1004,SHENZHEN,110-C,32,5433.2,female,40,Y,NaN,110,C
2013-01-07,1006,BEIJING,130-F,45,4432.0,female,40,Y,1.0,130,F

## 2、手动设置采样权重

In [162]:
weights = [0, 0.1, 0.7, 0, 0.2, 0.1]
df.sample(n=2, weights=weights)

     id       date       city category  age   price
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN

## 3、采样后不放回

In [139]:
df.sample(n=6, replace=False)

     id       date       city category  age   price
4  1005 2013-01-06   SHANGHAI    210-A   34     NaN
0  1001 2013-01-02    BEIJING    100-A   23  1200.9
2  1003 2013-01-04  GUANGZHOU    110-A   54  2133.0
1  1002 2013-01-03   shanghai    100-B   44     NaN
3  1004 2013-01-05   SHENZHEN    110-C   32  5433.2
5  1006 2013-01-07    BEIJING    130-F   45  4432.0

## 4、采样后放回

In [140]:
df.sample(n=6, replace=True)

     id       date      city category  age   price
1  1002 2013-01-03  shanghai    100-B   44     NaN
4  1005 2013-01-06  SHANGHAI    210-A   34     NaN
5  1006 2013-01-07   BEIJING    130-F   45  4432.0
5  1006 2013-01-07   BEIJING    130-F   45  4432.0
3  1004 2013-01-05  SHENZHEN    110-C   32  5433.2
4  1005 2013-01-06  SHANGHAI    210-A   34     NaN

## 5、数据表描述性统计

### round函数设置显示小数位，T表示转置

In [141]:
df.describe().round(2).T

       count     mean      std     min      25%     50%      75%     max
id       6.0  1003.50     1.87  1001.0  1002.25  1003.5  1004.75  1006.0
age      6.0    38.67    11.09    23.0    32.50    39.0    44.75    54.0
price    4.0  3299.78  1966.39  1200.9      NaN     NaN      NaN  5433.2

## 6、计算列的标准差

In [142]:
df['price'].std()

1966.3905891675404

## 7、计算两个字段间的协方差

In [143]:
df['price'].cov(df_inner['age'])

nan

## 8、数据表中所有字段间的协方差

In [144]:
df.cov()

                id          age         price
id        3.500000     5.800000  3.242617e+03
age       5.800000   123.066667  2.646583e+03
price  3242.616667  2646.583333  3.866692e+06

## 9、两个字段的相关性分析

In [145]:
df['price'].corr(df_inner['age'])

nan

## 10、数据表的相关性分析

In [146]:
df.corr()

             id       age     price
id     1.000000  0.279463  0.792163
age    0.279463  1.000000  0.098074
price  0.792163  0.098074  1.000000

# 八、数据输出

## 数据导出到Excel、CSV

In [165]:
df.to_excel('excel_to_python.xls',sheet_name='test1')
df.to_csv('excel_to_python.csv')